backend/jmeter_results/report/statistics.json
{
  "关键词搜索" : {
    "transaction" : "关键词搜索",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 305.95799999999986,
    "medianResTime" : 343.5,
    "minResTime" : 2.0,
    "maxResTime" : 657.0,
    "pct1ResTime" : 501.0,
    "pct2ResTime" : 525.0,
    "pct3ResTime" : 600.9300000000001,
    "throughput" : 15.971889474524836,
    "receivedKBytesPerSec" : 5.1783860405686,
    "sentKBytesPerSec" : 2.854351341638716
  },
  "获取帖子列表" : {
    "transaction" : "获取帖子列表",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1027.0500000000004,
    "medianResTime" : 1073.5,
    "minResTime" : 132.0,
    "maxResTime" : 1584.0,
    "pct1ResTime" : 1327.0,
    "pct2ResTime" : 1412.5,
    "pct3ResTime" : 1525.98,
    "throughput" : 15.90583744234134,
    "receivedKBytesPerSec" : 85.69580582948943,
    "sentKBytesPerSec" : 2.7804149435342773
  },
  "高级筛选搜索" : {
    "transaction" : "高级筛选搜索",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 371.75000000000006,
    "medianResTime" : 396.5,
    "minResTime" : 21.0,
    "maxResTime" : 772.0,
    "pct1ResTime" : 549.9000000000001,
    "pct2ResTime" : 586.0,
    "pct3ResTime" : 666.97,
    "throughput" : 15.965769390426924,
    "receivedKBytesPerSec" : 90.15046739789891,
    "sentKBytesPerSec" : 3.6172446275186
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2515,
    "errorCount" : 515,
    "errorPct" : 20.477137,
    "meanResTime" : 621.1677932405566,
    "medianResTime" : 366.0,
    "minResTime" : 2.0,
    "maxResTime" : 30029.0,
    "pct1ResTime" : 1089.0,
    "pct2ResTime" : 1222.0,
    "pct3ResTime" : 1486.5600000000013,
    "throughput" : 26.801508983567423,
    "receivedKBytesPerSec" : 66.33948974895566,
    "sentKBytesPerSec" : 5.541007174598777
  },
  "用户登录" : {
    "transaction" : "用户登录",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 254.5219999999999,
    "medianResTime" : 273.0,
    "minResTime" : 4.0,
    "maxResTime" : 548.0,
    "pct1ResTime" : 421.90000000000003,
    "pct2ResTime" : 444.9,
    "pct3ResTime" : 528.99,
    "throughput" : 16.015887760658575,
    "receivedKBytesPerSec" : 4.989324409814536,
    "sentKBytesPerSec" : 3.409632355296454
  },
  "AI生成帖子" : {
    "transaction" : "AI生成帖子",
    "sampleCount" : 15,
    "errorCount" : 15,
    "errorPct" : 100.0,
    "meanResTime" : 30003.733333333334,
    "medianResTime" : 30002.0,
    "minResTime" : 30001.0,
    "maxResTime" : 30029.0,
    "pct1ResTime" : 30013.4,
    "pct2ResTime" : 30029.0,
    "pct3ResTime" : 30029.0,
    "throughput" : 0.15984995417634645,
    "receivedKBytesPerSec" : 0.4347481663878173,
    "sentKBytesPerSec" : 0.0
  },
  "用户注册" : {
    "transaction" : "用户注册",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 265.08200000000033,
    "medianResTime" : 287.5,
    "minResTime" : 8.0,
    "maxResTime" : 556.0,
    "pct1ResTime" : 427.90000000000003,
    "pct2ResTime" : 449.95,
    "pct3ResTime" : 516.96,
    "throughput" : 15.997440409534473,
    "receivedKBytesPerSec" : 11.17927381618941,
    "sentKBytesPerSec" : 3.9504929211326187
  }
}